versao-backend/to-do-api/app/controllers/users_controller.rb

  def cancel_account
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]